Pastebin.org
#+TITLE: Pastebin
#+DATE: 29 April, 2017 
#+AUTHOR: SAMYAK AGARWAL (20161180), ANIRUDDHA P. DESHPANDE (20161058), KANAV GUPTA (20161151), SAYAK KUNDU (20161035)
#+SETUPFILE: theme-readtheorg.setup

* Overview
A pastebin is a text storage site. It is mostly used for sharing source code snippets for code review and sharing. 

* Goals
To implement a pastebin like web application which supports basic features. 
Features

* Features
  - =Syntax highlighting=
  - =Paste expiration=
  - =Guest and member privileges=
  - =Edit and  delete your pastes=
  - =View all your pastes (for members only)=
  - =Download codes=
  - =Embed=
* Application Structure
  [[https://www.draw.io/?lightbox=1&highlight=0000ff&edit=_blank&layers=1&nav=1&title=structure.xml#R5VnLbtwgFP0aLyvZxp7HMq%2B2i1aKlEpdE5vYpB5jAZPM5OsLBj%2FwnSQT1zOVnCwifAwXOOdcwIyHrja7bxxX%2BU%2BWksIL%2FXTnoWsvDFfLhfqvgb0BIj8wQMZpaqAecEdfiAV9i25pSoRTUTJWSFq5YMLKkiTSwTDn7Nmt9sAKt9cKZwQAdwkuIPqbpjK304r9Dv9OaJY3PQe%2BfXOPkz8ZZ9vS9ueF6KH%2BM683uIll64scp%2By5B6EbD11xxqQpbXZXpNDUNrSZdl9feduOm5NSHtPA6iTkvpk6SRUT9pFxmbOMlbi46dDLenpEB%2FDVUy43hSoGqvhIpNxbMfFWMgV1EX4wVtl6pk%2Fd0aujtpBgW57YWqilR7mOsA2RfK%2BqcFJgSZ%2FcUNjqn7X12qa3jKpOQt9aNQzXpol1KmqUaUJIzDMibauOSVXoDaODan4Pc41M4CdcbO1ob7GQ5J6WQARJdtLllhNBX%2FB9XUHTXukB1UOML734WiGacWHI1w1wQbNSlQvyoEM9ES6pMviFhaVW41JUOKFl9quW5kvUaqNrk93b6kApmgZrl9KgofS5S6WFhfJeFg2Z74vn0P4Gx0vAMTR4mV7oJUI9JQUWgiYu08e6E86%2FN7%2F4wPwa7F8di3yX3sWAN5M0wLEw0OqdQNNZfwVkqTh71Cv3rJwPGI2h8w85YwrnN1vnkdYvWUnG%2BV5txbUvesr%2Br1RAfuzw3fL%2F0VRAg5xq2XwnFRSbeN%2BrZr159ICbfjuNTcSxeRaE81%2F%2FUDDQyh8r%2BuKdQNOtfwHc%2B3FVzWvxG9IZrFZg8YtOtfhFZ1v8%2BkfS4JUz6ZkOAr5LOIrHJsJg2zrhGThYAKEqfQieVypE0XBlgalwsnPAJzgCDw0LiDvW%2BUCo0zm%2FmeWn0iWaSpdhoAl1gUemrSB85gtSeL69%2BcC9x%2FyNP%2FabHAh1um%2FyMAa6CKlISGZu%2FeiM1oennflbf%2Bw3OBBqGGhC68MzkiSbSvFAxMzdv4Q3UstTuR%2Fe%2Bs3e%2FWjsZcRQKBBoQvevgS6cVIzP7DIWWH8dAutP9BGmHruf7Iwi3c%2Bi6OYv][structure]]
* Implementation
  
** Flask
This project of pastebin has been implemented using Flask. Flask is called a micro framework because it does not require particular tools or libraries. 
It has no database abstraction layer, form validation, or any other components where pre-existing third-party libraries provide common functions. 
However, Flask supports extensions that can add application features as if they were implemented in Flask itself. Extensions exist for object-relational mappers, 
form validation, upload handling, various open authentication technologies and several common framework related tools. Extensions are updated far more regularly 
than the core Flask program. 

+ =Contains development server and debugger=
+ =Uses /Jinja2/ templating=
+ =Support for secure cookies (client side sessions)=
+ =Integrated support for unit testing=
+ =*RESTful* request dispatching=
+ =Extensions available to enhance features desired=
*** Example
**** A simple web application to print “Hello World!”
#+BEGIN_SRC python
from flask import Flask
app = Flask(__name__)

@app.route("/")
def hello():
    return "Hello World!"

if __name__ == "__main__":
    app.run()
#+END_SRC

*** Official *Flask documentation* [[http://flask.pocoo.org/docs/0.12/][here]].
*** Backend
