Pastebin.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Pastebin</title>
<!-- 2017-04-29 Sat 07:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="SAMYAK AGARWAL (20161180), ANIRUDDHA P. DESHPANDE (20161058), KANAV GUPTA (20161151), SAYAK KUNDU (20161035)" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Pastebin</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Overview</a></li>
<li><a href="#sec-2">2. Goals</a></li>
<li><a href="#sec-3">3. Features</a></li>
<li><a href="#sec-4">4. Application Structure</a></li>
<li><a href="#sec-5">5. Implementation</a>
<ul>
<li><a href="#sec-5-1">5.1. Flask</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1. Example</a></li>
<li><a href="#sec-5-1-2">5.1.2. Official <b>Flask documentation</b> here.</a></li>
<li><a href="#sec-5-1-3">5.1.3. Backend</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2. highlight.js</a></li>
<li><a href="#sec-5-3">5.3. Download</a></li>
<li><a href="#sec-5-4">5.4. Embed</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Deployment</a>
<ul>
<li><a href="#sec-6-1">6.1. nginx</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Self-Signed SSL Certificate</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
A pastebin is a text storage site. It is mostly used for sharing source code snippets for code review and sharing. 
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Goals</h2>
<div class="outline-text-2" id="text-2">
<p>
To implement a pastebin like web application which supports basic features. 
Features
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Features</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>Syntax highlighting</code>
</li>
<li><code>Paste expiration</code>
</li>
<li><code>Guest and member privileges</code>
</li>
<li><code>Edit and  delete your pastes</code>
</li>
<li><code>View all your pastes (for members only)</code>
</li>
<li><code>Download codes</code>
</li>
<li><code>Embed</code>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Application Structure</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://www.draw.io/?lightbox=1&highlight=0000ff&edit=_blank&layers=1&nav=1&title=structure.xml#R5VnLbtwgFP0aLyvZxp7HMq+2i1aKlEpdE5vYpB5jAZPM5OsLBj/wnSQT1zOVnCwifAwXOOdcwIyHrja7bxxX+U+WksIL/XTnoWsvDFfLhfqvgb0BIj8wQMZpaqAecEdfiAV9i25pSoRTUTJWSFq5YMLKkiTSwTDn7Nmt9sAKt9cKZwQAdwkuIPqbpjK304r9Dv9OaJY3PQe+fXOPkz8ZZ9vS9ueF6KH+M683uIll64scp+y5B6EbD11xxqQpbXZXpNDUNrSZdl9feduOm5NSHtPA6iTkvpk6SRUT9pFxmbOMlbi46dDLenpEB/DVUy43hSoGqvhIpNxbMfFWMgV1EX4wVtl6pk/d0aujtpBgW57YWqilR7mOsA2RfK+qcFJgSZ/cUNjqn7X12qa3jKpOQt9aNQzXpol1KmqUaUJIzDMibauOSVXoDaODan4Pc41M4CdcbO1ob7GQ5J6WQARJdtLllhNBX/B9XUHTXukB1UOML734WiGacWHI1w1wQbNSlQvyoEM9ES6pMviFhaVW41JUOKFl9quW5kvUaqNrk93b6kApmgZrl9KgofS5S6WFhfJeFg2Z74vn0P4Gx0vAMTR4mV7oJUI9JQUWgiYu08e6E86/N7/4wPwa7F8di3yX3sWAN5M0wLEw0OqdQNNZfwVkqTh71Cv3rJwPGI2h8w85YwrnN1vnkdYvWUnG+V5txbUvesr+r1RAfuzw3fL/0VRAg5xq2XwnFRSbeN+rZr159ICbfjuNTcSxeRaE81//UDDQyh8r+uKdQNOtfwHc+3FVzWvxG9IZrFZg8YtOtfhFZ1v8+kfS4JUz6ZkOAr5LOIrHJsJg2zrhGThYAKEqfQieVypE0XBlgalwsnPAJzgCDw0LiDvW+UCo0zm/meWn0iWaSpdhoAl1gUemrSB85gtSeL69+cC9x/yNP/abHAh1um/yMAa6CKlISGZu/eiM1oennflbf+w3OBBqGGhC68MzkiSbSvFAxMzdv4Q3UstTuR/e+s3e/WjsZcRQKBBoQvevgS6cVIzP7DIWWH8dAutP9BGmHruf7Iwi3c+i6OYv">structure</a>
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Implementation</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Flask</h3>
<div class="outline-text-3" id="text-5-1">
<p>
This project of pastebin has been implemented using Flask. Flask is called a micro framework because it does not require particular tools or libraries. 
It has no database abstraction layer, form validation, or any other components where pre-existing third-party libraries provide common functions. 
However, Flask supports extensions that can add application features as if they were implemented in Flask itself. Extensions exist for object-relational mappers, 
form validation, upload handling, various open authentication technologies and several common framework related tools. Extensions are updated far more regularly 
than the core Flask program. 
</p>

<ul class="org-ul">
<li><code>Contains development server and debugger</code>
</li>
<li><code>Uses /Jinja2/ templating</code>
</li>
<li><code>Support for secure cookies (client side sessions)</code>
</li>
<li><code>Integrated support for unit testing</code>
</li>
<li><code>*RESTful* request dispatching</code>
</li>
<li><code>Extensions available to enhance features desired</code>
</li>
</ul>
</div>
<div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> Example</h4>
<div class="outline-text-4" id="text-5-1-1">
</div><ol class="org-ol"><li><a id="sec-5-1-1-1" name="sec-5-1-1-1"></a>A simple web application to print “Hello World!”<br  /><div class="outline-text-5" id="text-5-1-1-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #a020f0;">from</span> flask <span style="color: #a020f0;">import</span> Flask
<span style="color: #a0522d;">app</span> = Flask(<span style="color: #483d8b;">__name__</span>)

<span style="color: #228b22;">@app.route</span>(<span style="color: #8b2252;">"/"</span>)
<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">hello</span>():
    <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Hello World!"</span>

<span style="color: #a020f0;">if</span> <span style="color: #483d8b;">__name__</span> == <span style="color: #8b2252;">"__main__"</span>:
    app.run()
</pre>
</div>
</div>
</li></ol>
</div>

<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> Official <b>Flask documentation</b> <a href="http://flask.pocoo.org/docs/0.12/">here</a>.</h4>
</div>
