Pastebin.org
***** Paste
Our project supports paste feature for 2 types of users:
    1. *Guests*
    2. *Registered users*
#+NAME: create_paste
#+BEGIN_SRC python
def create_paste():
    title = request.form['title']
    text = request.form['text']
    user_id = session['user_id']
    lang = request.form['lang']
    time_form = request.form['time']
    expire_time = str(time_form)
    add_time = str(datetime.now())
    url = str(uuid.uuid4())
    report_count = 0
    try:
        paste = Paste(title, text, lang, add_time,
                      expire_time, user_id, url, report_count)
        db.session.add(paste)
        db.session.commit()
        # jsonify(success=True, paste=paste.to_dict())
        return jsonify({'url': url}), 200
    except:
        return jsonify({'error': 'Error while creating Paste, Please check if all fields are filled'}), 400

#+END_SRC

Certain characteristics are related to the paste feature which define its proper working. 
#+BEGIN_SRC python
def __init__(self, title, text, lang, add_time, expire_time, user_id, url, report_count):
        self.title = title
        self.text = text
        self.lang = lang
        self.add_time = add_time
        self.expire_time = expire_time
        self.user_id = user_id
        self.url = url
        self.report_count = report_count

#+END_SRC
The variable names are self-explanatory.
We can choose paste *language*, *expiry time* and *title*. After the paste is done we get a unque URL which can be shared
with other people so that they can have a look at your paste.

*edit_paste*, *get_all_pastes*, *delete_paste* features are supported for registered users only.
#+NAME: edit_paste
#+BEGIN_SRC python
def edit_paste(url):
    if 'user_id' in session:
        user_id = session['user_id']
        paste = Paste.query.filter(Paste.url == url).first()
        if paste.user_id != user_id:
            return jsonify(success=False, reply="Not Authorized"), 404
        title = request.form['title']
        text = request.form['text']
        lang = request.form['lang']
        time_form = request.form['time']
        expire_time = str(time_form)

        paste.title = title
        paste.text = text
        paste.lang = lang
        paste.expire_time = expire_time
        db.session.commit()
        return jsonify(success=True, url=url)
    return jsonify(success=False, reply="Please Login")    

#+END_SRC
#+NAME: get_all_pastes
#+BEGIN_SRC python
def get_all_pastes():
    # user_id = session['user_id']
    # pastes = paste.query.filter(paste.user_id == user_id).all()
    curr_id = session['user_id']
    paste_list = Paste.query.filter(curr_id == Paste.user_id).all()
    url_pre = "/"
    for paste in paste_list:
        paste.url = url_pre + paste.url
    return render_template('mypaste.html', paste_list=paste_list)
    # return jsonify(success=True, pastes=[paste.to_dict() for paste in
    # pastes])

#+END_SRC
#+NAME: delete_paste
#+BEGIN_SRC python 
def delete_paste(url):
    user_id = session['user_id']
    # print(user_id)
    paste = Paste.query.filter(
        Paste.url == url, Paste.user_id == user_id).first()
    if paste is None:
        return jsonify(success=False), 404
    else:
        db.session.delete(paste)
        db.session.commit()
        return jsonify(success=True), 200

#+END_SRC

Our web apllication also supports downloadin of the shared snippets of codes.  

