Pastebin.html
<div id="outline-container-sec-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><span class="section-number-4">5.1.3</span> Backend</h4>
<div class="outline-text-4" id="text-5-1-3">
</div><ol class="org-ol"><li><a id="sec-5-1-3-0-1" name="sec-5-1-3-0-1"></a>Paste<br  /><div class="outline-text-6" id="text-5-1-3-0-1">
<p>
Our project supports paste feature for 2 types of users:
</p>
<ol class="org-ol">
<li><b>Guests</b>
</li>
<li><b>Registered users</b>
</li>
</ol>
<div class="org-src-container">

<pre class="src src-python" id="create_paste"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">create_paste</span>():
    <span style="color: #a0522d;">title</span> = request.form[<span style="color: #8b2252;">'title'</span>]
    <span style="color: #a0522d;">text</span> = request.form[<span style="color: #8b2252;">'text'</span>]
    <span style="color: #a0522d;">user_id</span> = session[<span style="color: #8b2252;">'user_id'</span>]
    <span style="color: #a0522d;">lang</span> = request.form[<span style="color: #8b2252;">'lang'</span>]
    <span style="color: #a0522d;">time_form</span> = request.form[<span style="color: #8b2252;">'time'</span>]
    <span style="color: #a0522d;">expire_time</span> = <span style="color: #483d8b;">str</span>(time_form)
    <span style="color: #a0522d;">add_time</span> = <span style="color: #483d8b;">str</span>(datetime.now())
    <span style="color: #a0522d;">url</span> = <span style="color: #483d8b;">str</span>(uuid.uuid4())
    <span style="color: #a0522d;">report_count</span> = 0
    <span style="color: #a020f0;">try</span>:
        <span style="color: #a0522d;">paste</span> = Paste(title, text, lang, add_time,
                      expire_time, user_id, url, report_count)
        db.session.add(paste)
        db.session.commit()
        <span style="color: #b22222;"># </span><span style="color: #b22222;">jsonify(success=True, paste=paste.to_dict())</span>
        <span style="color: #a020f0;">return</span> jsonify({<span style="color: #8b2252;">'url'</span>: url}), 200
    <span style="color: #a020f0;">except</span>:
        <span style="color: #a020f0;">return</span> jsonify({<span style="color: #8b2252;">'error'</span>: <span style="color: #8b2252;">'Error while creating Paste, Please check if all fields are filled'</span>}), 400
</pre>
</div>

<p>
Certain characteristics are related to the paste feature which define its proper working. 
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>, title, text, lang, add_time, expire_time, user_id, url, report_count):
        <span style="color: #a020f0;">self</span>.title = title
        <span style="color: #a020f0;">self</span>.text = text
        <span style="color: #a020f0;">self</span>.lang = lang
        <span style="color: #a020f0;">self</span>.add_time = add_time
        <span style="color: #a020f0;">self</span>.expire_time = expire_time
        <span style="color: #a020f0;">self</span>.user_id = user_id
        <span style="color: #a020f0;">self</span>.url = url
        <span style="color: #a020f0;">self</span>.report_count = report_count
</pre>
</div>
<p>
The variable names are self-explanatory.
We can choose paste <b>language</b>, <b>expiry time</b> and <b>title</b>. After the paste is done we get a unque URL which can be shared
with other people so that they can have a look at your paste.
</p>

<p>
<b>edit<sub>paste</sub></b>, <b>get<sub>all</sub><sub>pastes</sub></b>, <b>delete<sub>paste</sub></b> features are supported for registered users only.
</p>
<div class="org-src-container">

<pre class="src src-python" id="edit_paste"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">edit_paste</span>(url):
    <span style="color: #a020f0;">if</span> <span style="color: #8b2252;">'user_id'</span> <span style="color: #a020f0;">in</span> session:
        <span style="color: #a0522d;">user_id</span> = session[<span style="color: #8b2252;">'user_id'</span>]
        <span style="color: #a0522d;">paste</span> = Paste.query.<span style="color: #483d8b;">filter</span>(Paste.url == url).first()
        <span style="color: #a020f0;">if</span> paste.user_id != user_id:
            <span style="color: #a020f0;">return</span> jsonify(success=<span style="color: #008b8b;">False</span>, reply=<span style="color: #8b2252;">"Not Authorized"</span>), 404
        <span style="color: #a0522d;">title</span> = request.form[<span style="color: #8b2252;">'title'</span>]
        <span style="color: #a0522d;">text</span> = request.form[<span style="color: #8b2252;">'text'</span>]
        <span style="color: #a0522d;">lang</span> = request.form[<span style="color: #8b2252;">'lang'</span>]
        <span style="color: #a0522d;">time_form</span> = request.form[<span style="color: #8b2252;">'time'</span>]
        <span style="color: #a0522d;">expire_time</span> = <span style="color: #483d8b;">str</span>(time_form)

        <span style="color: #a0522d;">paste.title</span> = title
        <span style="color: #a0522d;">paste.text</span> = text
        <span style="color: #a0522d;">paste.lang</span> = lang
        <span style="color: #a0522d;">paste.expire_time</span> = expire_time
        db.session.commit()
        <span style="color: #a020f0;">return</span> jsonify(success=<span style="color: #008b8b;">True</span>, url=url)
    <span style="color: #a020f0;">return</span> jsonify(success=<span style="color: #008b8b;">False</span>, reply=<span style="color: #8b2252;">"Please Login"</span>)
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python" id="get_all_pastes"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get_all_pastes</span>():
    <span style="color: #b22222;"># </span><span style="color: #b22222;">user_id = session['user_id']</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">pastes = paste.query.filter(paste.user_id == user_id).all()</span>
    <span style="color: #a0522d;">curr_id</span> = session[<span style="color: #8b2252;">'user_id'</span>]
    <span style="color: #a0522d;">paste_list</span> = Paste.query.<span style="color: #483d8b;">filter</span>(curr_id == Paste.user_id).<span style="color: #483d8b;">all</span>()
    <span style="color: #a0522d;">url_pre</span> = <span style="color: #8b2252;">"/"</span>
    <span style="color: #a020f0;">for</span> paste <span style="color: #a020f0;">in</span> paste_list:
        <span style="color: #a0522d;">paste.url</span> = url_pre + paste.url
    <span style="color: #a020f0;">return</span> render_template(<span style="color: #8b2252;">'mypaste.html'</span>, paste_list=paste_list)
    <span style="color: #b22222;"># </span><span style="color: #b22222;">return jsonify(success=True, pastes=[paste.to_dict() for paste in</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">pastes])</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python" id="delete_paste"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">delete_paste</span>(url):
    <span style="color: #a0522d;">user_id</span> = session[<span style="color: #8b2252;">'user_id'</span>]
    <span style="color: #b22222;"># </span><span style="color: #b22222;">print(user_id)</span>
    <span style="color: #a0522d;">paste</span> = Paste.query.<span style="color: #483d8b;">filter</span>(
        Paste.url == url, Paste.user_id == user_id).first()
    <span style="color: #a020f0;">if</span> paste <span style="color: #a020f0;">is</span> <span style="color: #008b8b;">None</span>:
        <span style="color: #a020f0;">return</span> jsonify(success=<span style="color: #008b8b;">False</span>), 404
    <span style="color: #a020f0;">else</span>:
        db.session.delete(paste)
        db.session.commit()
        <span style="color: #a020f0;">return</span> jsonify(success=<span style="color: #008b8b;">True</span>), 200
</pre>
</div>

<p>
Our web apllication also supports downloadin of the shared snippets of codes.  
</p>
</div>
</li>
