Pastebin.org
***** User
Users can make a paste either as a guest or by logging in or registering as a new user.
#+NAME: for registerd user
#+BEGIN_SRC python
    def __init__(self, username, email, password, paste_count, user_type):
        self.username = username
        self.email = email
        self.password = generate_password_hash(password)
        self.paste_count = paste_count
        self.user_type = user_type
#+END_SRC
#+NAME: for guest user
#+BEGIN_SRC 

#+END_SRC

User is identified by its *username* and *password*.
#+NAME: login
#+BEGIN_SRC python
def login_user():
    try:
        username = request.form['username']
        password = request.form['password']
    except KeyError as e:
        return jsonify({'error': 'All Credentials not filled'}), 400

    user = User.query.filter(User.username == username).first()
    if(user is None or not user.check_password(password)):
        return jsonify({'error': 'Invalid Username , User doesnt exist'}), 400

    session['user_id'] = user.id

    return jsonify({'succes': 'Login successful'}), 200

#+END_SRC 

For registering, a user must input his *email-id*, *username* and *password*.
=password= is stored in encrypted form (not in clear-text) to enhace security.

#+NAME: register_user
#+BEGIN_SRC python 
def register_user():
    username = request.form['username']
    email = request.form['email']
    password = request.form['password']

    # except KeyError as e:
    # return render_template('register.html',error = "%s not sent in the
    # request" % e.args)

    if '@' not in email:
        return jsonify({'error': '@ not added in email'}), 400

    u = User(username, email, password, 0, 1)
    db.session.add(u)
    try:
        db.session.commit()
    except IntegrityError as e:
        return jsonify({'error': 'Invalid Credentials'}), 400

    return jsonify({'success': 'User Registeration successful'}), 200

#+END_SRC
Admin feature has also been added.

***** Report
Pastebin also has the a feature to report pastes which users find offensive.
Only registered users can report pastes along with the reason to do so.

#+NAME: report_paste 
#+BEGIN_SRC python
def __init__(self, paste_id, reason, reporter_id):
        self.paste_id = paste_id
        self.reason = reason
        self.reporter_id = reporter_id
#+END_SRC

A paste is checked according to its *paste id* and removed after certain number of reports.

** highlight.js

The main feature of pastebin is syntax highlighting, that is, to be able to select the language of paste. This project supports {} languages as of now. This feature was implemented  by using =highlight.js=. 
*highlight.js* is used for syntax highlighting for web. In most of the cases it detects the language automatically.  
The bare minimum for using highlight.js on a web page is linking to the library along with one of the styles and calling =initHighlightingOnLoad=

#+BEGIN_SRC html 
<link rel="stylesheet" href="/path/to/styles/default.css">
<script src="/path/to/highlight.pack.js"></script>
<script>hljs.initHighlightingOnLoad();</script>

#+END_SRC
	
This method will find and highlight the code inside of *<pre><code>* tags; it tries to detect the language automatically. If automatic detection doesn’t work for you, 
you can specify the language in the *class* attribute or can be asked as an input (like in our project) from the user.

#+BEGIN_SRC html
<pre><code class="C">...</code></pre>
#+END_SRC

** Download
The user can download the code according to the language extension given by the owner
of the paste.
** Embed
It is used to include codes saved in pastebin in your websites.
* Deployment
** nginx
To Deploy python apps, we use *nginx* as a *reverse proxy server*. We use *uWSGI* with nginx to deploy python apps like flask. 
Insight about WSGI - Web Server Gateway Interface (WSGI) is a specification for simple and universal interface between 
web servers and web applications.

* Self-Signed SSL Certificate
A self-signed certificate will not validate the identity of your server 
for your users since it is not signed by one of their web browser's trusted 
certificate authorities, but it will allow you to encrypt communications with your web clients. 
example : /*digicert*/ is a trustworthy SSL certificates provider.
