Pastebin.html

<li><a id="sec-5-1-3-0-2" name="sec-5-1-3-0-2"></a>User<br  /><div class="outline-text-6" id="text-5-1-3-0-2">
<p>
Users can make a paste either as a guest or by logging in or registering as a new user.
</p>
<div class="org-src-container">

<pre class="src src-python" id="for-registerd-user"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>, username, email, password, paste_count, user_type):
    <span style="color: #a020f0;">self</span>.username = username
    <span style="color: #a020f0;">self</span>.email = email
    <span style="color: #a020f0;">self</span>.password = generate_password_hash(password)
    <span style="color: #a020f0;">self</span>.paste_count = paste_count
    <span style="color: #a020f0;">self</span>.user_type = user_type
</pre>
</div>
<pre class="example" id="for-guest-user">
</pre>

<p>
User is identified by its <b>username</b> and <b>password</b>.
</p>
<div class="org-src-container">

<pre class="src src-python" id="login"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">login_user</span>():
    <span style="color: #a020f0;">try</span>:
        <span style="color: #a0522d;">username</span> = request.form[<span style="color: #8b2252;">'username'</span>]
        <span style="color: #a0522d;">password</span> = request.form[<span style="color: #8b2252;">'password'</span>]
    <span style="color: #a020f0;">except</span> <span style="color: #228b22;">KeyError</span> <span style="color: #a020f0;">as</span> e:
        <span style="color: #a020f0;">return</span> jsonify({<span style="color: #8b2252;">'error'</span>: <span style="color: #8b2252;">'All Credentials not filled'</span>}), 400

    <span style="color: #a0522d;">user</span> = User.query.<span style="color: #483d8b;">filter</span>(User.username == username).first()
    <span style="color: #a020f0;">if</span>(user <span style="color: #a020f0;">is</span> <span style="color: #008b8b;">None</span> <span style="color: #a020f0;">or</span> <span style="color: #a020f0;">not</span> user.check_password(password)):
        <span style="color: #a020f0;">return</span> jsonify({<span style="color: #8b2252;">'error'</span>: <span style="color: #8b2252;">'Invalid Username , User doesnt exist'</span>}), 400

    <span style="color: #a0522d;">session</span>[<span style="color: #8b2252;">'user_id'</span>] = user.<span style="color: #483d8b;">id</span>

    <span style="color: #a020f0;">return</span> jsonify({<span style="color: #8b2252;">'succes'</span>: <span style="color: #8b2252;">'Login successful'</span>}), 200
</pre>
</div>

<p>
For registering, a user must input his <b>email-id</b>, <b>username</b> and <b>password</b>.
<code>password</code> is stored in encrypted form (not in clear-text) to enhace security.
</p>

<div class="org-src-container">

<pre class="src src-python" id="register_user"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">register_user</span>():
    <span style="color: #a0522d;">username</span> = request.form[<span style="color: #8b2252;">'username'</span>]
    <span style="color: #a0522d;">email</span> = request.form[<span style="color: #8b2252;">'email'</span>]
    <span style="color: #a0522d;">password</span> = request.form[<span style="color: #8b2252;">'password'</span>]

    <span style="color: #b22222;"># </span><span style="color: #b22222;">except KeyError as e:</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">return render_template('register.html',error = "%s not sent in the</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">request" % e.args)</span>

    <span style="color: #a020f0;">if</span> <span style="color: #8b2252;">'@'</span> <span style="color: #a020f0;">not</span> <span style="color: #a020f0;">in</span> email:
        <span style="color: #a020f0;">return</span> jsonify({<span style="color: #8b2252;">'error'</span>: <span style="color: #8b2252;">'@ not added in email'</span>}), 400

    <span style="color: #a0522d;">u</span> = User(username, email, password, 0, 1)
    db.session.add(u)
    <span style="color: #a020f0;">try</span>:
        db.session.commit()
    <span style="color: #a020f0;">except</span> IntegrityError <span style="color: #a020f0;">as</span> e:
        <span style="color: #a020f0;">return</span> jsonify({<span style="color: #8b2252;">'error'</span>: <span style="color: #8b2252;">'Invalid Credentials'</span>}), 400

    <span style="color: #a020f0;">return</span> jsonify({<span style="color: #8b2252;">'success'</span>: <span style="color: #8b2252;">'User Registeration successful'</span>}), 200
</pre>
</div>
<p>
Admin feature has also been added.
</p>
</div>
</li>

<li><a id="sec-5-1-3-0-3" name="sec-5-1-3-0-3"></a>Report<br  /><div class="outline-text-6" id="text-5-1-3-0-3">
<p>
Pastebin also has the a feature to report pastes which users find offensive.
Only registered users can report pastes along with the reason to do so.
</p>

<div class="org-src-container">

<pre class="src src-python" id="report_paste"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__init__</span>(<span style="color: #a020f0;">self</span>, paste_id, reason, reporter_id):
        <span style="color: #a020f0;">self</span>.paste_id = paste_id
        <span style="color: #a020f0;">self</span>.reason = reason
        <span style="color: #a020f0;">self</span>.reporter_id = reporter_id
</pre>
</div>

<p>
A paste is checked according to its <b>paste id</b> and removed after certain number of reports.
</p>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> highlight.js</h3>
<div class="outline-text-3" id="text-5-2">
<p>
The main feature of pastebin is syntax highlighting, that is, to be able to select the language of paste. This project supports {} languages as of now. This feature was implemented  by using <code>highlight.js</code>. 
<b>highlight.js</b> is used for syntax highlighting for web. In most of the cases it detects the language automatically.  
The bare minimum for using highlight.js on a web page is linking to the library along with one of the styles and calling <code>initHighlightingOnLoad</code>
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #0000ff;">link</span> <span style="color: #a0522d;">rel</span>=<span style="color: #8b2252;">"stylesheet"</span> <span style="color: #a0522d;">href</span>=<span style="color: #8b2252;">"/path/to/styles/default.css"</span>&gt;
&lt;<span style="color: #0000ff;">script</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"/path/to/highlight.pack.js"</span>&gt;&lt;/<span style="color: #0000ff;">script</span>&gt;
&lt;<span style="color: #0000ff;">script</span>&gt;hljs.initHighlightingOnLoad();&lt;/<span style="color: #0000ff;">script</span>&gt;
</pre>
</div>

<p>
This method will find and highlight the code inside of <b>&lt;pre&gt;&lt;code&gt;</b> tags; it tries to detect the language automatically. If automatic detection doesn’t work for you, 
you can specify the language in the <b>class</b> attribute or can be asked as an input (like in our project) from the user.
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #0000ff;">pre</span>&gt;&lt;<span style="color: #0000ff;">code</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"C"</span>&gt;...&lt;/<span style="color: #0000ff;">code</span>&gt;&lt;/<span style="color: #0000ff;">pre</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Download</h3>
<div class="outline-text-3" id="text-5-3">
<p>
The user can download the code according to the language extension given by the owner
of the paste.
</p>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Embed</h3>
<div class="outline-text-3" id="text-5-4">
<p>
It is used to include codes saved in pastebin in your websites.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Deployment</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> nginx</h3>
<div class="outline-text-3" id="text-6-1">
<p>
To Deploy python apps, we use <b>nginx</b> as a <b>reverse proxy server</b>. We use <b>uWSGI</b> with nginx to deploy python apps like flask. 
Insight about WSGI - Web Server Gateway Interface (WSGI) is a specification for simple and universal interface between 
web servers and web applications.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Self-Signed SSL Certificate</h2>
<div class="outline-text-2" id="text-7">
<p>
A self-signed certificate will not validate the identity of your server 
for your users since it is not signed by one of their web browser's trusted 
certificate authorities, but it will allow you to encrypt communications with your web clients. 
example : <i><b>digicert</b></i> is a trustworthy SSL certificates provider.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 29 April, 2017</p>
<p class="author">Author: SAMYAK AGARWAL (20161180), ANIRUDDHA P. DESHPANDE (20161058), KANAV GUPTA (20161151), SAYAK KUNDU (20161035)</p>
<p class="date">Created: 2017-04-29 Sat 07:48</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
